{
    "name": "Snowflake",
    "displayName": "Snowflake Test Connection",
    "description": "This Test Connection validates the access against the database and basic metadata extraction of schemas and tables.",
    "steps": [
      {
        "name": "CheckAccess",
        "description": "Validate that we can properly reach the database and authenticate with the given credentials.",
        "errorMessage": "Failed to connect to snowflake, please validate the credentials",
        "shortCircuit": true,
        "mandatory": true
      },
      {
        "name": "GetDatabases",
        "description": "List all the available databases to the user. If all databases option is selected, we will try to go beyond the configured database.",
        "errorMessage": "Failed to fetch databases, please validate if the user has enough privilege to fetch databases.",
        "mandatory": true
      },
      {
        "name": "GetSchemas",
        "description": "List all the schemas available to the user.",
        "errorMessage": "Failed to fetch schemas, please validate if the user has enough privilege to fetch schemas.",
        "mandatory": true
      },
      {
        "name": "GetTables",
        "description": "From a given schema, list the tables belonging to that schema. If no schema is specified, we'll list the tables of a random schema.",
        "errorMessage": "Failed to fetch tables, please validate if the user has enough privilege to fetch tables.",
        "mandatory": true
      },
      {
        "name": "GetViews",
        "description": "From a given schema, list the views belonging to that schema. If no schema is specified, we'll list the tables of a random schema.",
        "errorMessage": "Failed to fetch views, please validate if the user has enough privilege to fetch views.",
        "mandatory": false
      },
      {
        "name": "GetStreams",
        "description": "From a given schema, list the streams belonging to that schema. If no schema is specified, we'll list the streams of a random schema.",
        "errorMessage": "Failed to fetch streams, please validate if the user has enough privilege to fetch streams.",
        "mandatory": false
      },
      {
        "name": "GetTags",
        "description": "Check if we can access the snowflake.account_usage.tag_references table to list all available tags.",
        "errorMessage": "Failed to fetch tags, please validate if the user has at least select privileges for snowflake.account_usage.tag_references table.",
        "mandatory": false
      },
      {
        "name": "GetQueries",
        "description": "Check if we can access the snowflake.account_usage.query_history table to get query logs, These queries are analyzed in the usage & lineage workflow.",
        "errorMessage": "Failed to fetch queries, please validate if user has select privilege for table snowflake.account_usage.query_history to get query logs.",
        "mandatory": false
      }
    ]
  }
  
  